overset_plate_fixed/overSimpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       59370;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       59410;
    }
    topAndBottom
    {
        type            patch;
        nFaces          120;
        startFace       59450;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          59712;
        startFace       59570;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       119282;
    }
    overSetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          608;
        startFace       119410;
    }
)

// ************************************************************************* //
